{
  "format": "WLC",
  "formatVersion": "0.2.0",
  "sources": [
    {
      "name": "XGE",
      "description": "Xenethar Guide to Everything (XGE)",
      "version": 0,
      "spells": [
        {
          "name": "Frostbite",
          "classes": ["warlock", "wizard", "sorcerer", "druid"],
          "school": "evocation",
          "level": 0,
          "range": "60 feet",
          "duration": "Instantaneous",
          "casting": "1 action",
          "verbal": true,
          "somatic": true,
          "material": 0,
          "materials": null,
          "concentration": false,
          "ritual": false,
          "description": "You cause numbing frost to form on one creature that you can see within range. The target must make a Constitution saving throw. On a failed save, the target takes 1d6 cold damage, and it has disadvantage on the next weapon attack roll it makes before the end of its next turn.",
          "atHigherLevel": "The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
        },
        {
          "name": "Hex",
          "classes": ["warlock"],
          "school": "enchantment",
          "level": 1,
          "range": "90 feet",
          "duration": "Up to 1 hour",
          "casting": "1 bonus action",
          "verbal": true,
          "somatic": true,
          "material": 0,
          "materials": null,
          "concentration": true,
          "ritual": false,
          "description": "<p>You place a curse on a creature that you can see within range. Until the spell ends, you deal an extra 1d6 necrotic damage to the target whenever you hit it with an attack. Also, choose one ability when you cast the spell. The target has disadvantage on ability checks made with the chosen ability.</p>\n\n<p>If the target drops to 0 hit points before this spell ends, you can use a bonus action on a subsequent turn of yours to curse a new creature.</p>\n\n<p>A remove curse cast on the target ends this spell early.</p>\n<p><b>At Higher Levels.</b></p>\n<p>When you cast this spell using a spell slot of 3rd or 4th level, you can maintain your concentration on the spell for up to 8 hours. When you use a spell slot of 5th level or higher, you can maintain your concentration on the spell for up to 24 hours.</p>",
          "atHigherLevel": null
        },
        {
          "name": "Thunderclap",
          "classes": ["bard", "sorcerer", "warlock", "wizard", "druid"],
          "school": "evocation",
          "level": 0,
          "range": "5 feet",
          "duration": "Instantaneous",
          "casting": "1 action",
          "verbal": false,
          "somatic": true,
          "material": 0,
          "materials": null,
          "concentration": false,
          "ritual": false,
          "description": "You create a burst of thunderous sound that can be heard up to 100 feet away. Each creature within range, other than you, must make a Constitution saving throw or take 1d6 thunder damage.",
          "atHigherLevel": "The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
        },
        {
          "name": "Toll the Dead",
          "classes": ["warlock", "wizard", "cleric"],
          "school": "necromancy",
          "level": 0,
          "range": "60 feet",
          "duration": "Instantaneous",
          "casting": "1 action",
          "verbal": true,
          "somatic": true,
          "material": 0,
          "materials": null,
          "concentration": false,
          "ritual": false,
          "description": "You point at one creature you can see within range, and the sound of a dolorous bell fills the air around it for a moment. The target must succeed on a Wisdom saving throw or take 1d8 necrotic damage. If the target is missing any of its hit points, it instead takes 1d12 necrotic damage.",
          "atHigherLevel": "The spell's damage increases by one die when you reach 5th level (2d8 or 2d12), 11th level (3d8 or 3d12), and 17th level (4d8 or 4d12)."
        },
        {
          "name": "Magic Stone",
          "classes": ["warlock", "druid"],
          "school": "transmutation",
          "level": 0,
          "range": "Touch",
          "duration": "1 minute",
          "casting": "1 bonus action",
          "verbal": true,
          "somatic": true,
          "material": 0,
          "materials": null,
          "concentration": false,
          "ritual": false,
          "description": "You touch one to three pebbles and imbue them with magic. You or someone else can make a ranged spell attack with one of the pebbles by throwing it or hurling it with a sling. If thrown, a pebble has a range of 60 feet. If someone else attacks with a pebble, that attacker adds your spellcasting ability modifier, not the attacker's, to the attack roll. On a hit, the target takes bludgeoning damage equal to 1d6 + your spellcasting ability modifier. Whether the attack hits or misses, the spell then ends on the stone.\n\n<p>If you cast this spell again, the spell ends on any pebbles still affected by your previous casting.</p>",
          "atHigherLevel": null
        },
        {
          "name": "Infestation",
          "classes": ["bard", "druid", "sorcerer", "wizard"],
          "school": "conjuration",
          "level": 0,
          "range": "30 feet",
          "duration": "Instantaneous",
          "casting": "1 action",
          "verbal": true,
          "somatic": true,
          "material": 1,
          "materials": "a living flea",
          "concentration": false,
          "ritual": false,
          "description": "You cause a cloud of mites, fleas, and other parasites to appear momentarily on one creature you can see within range. The target must succeed on a Constitution saving throw, or it takes 1d6 poison damage and moves 5 feet in a random direction if it can move and its speed is at least 5 feet. Roll a d4 for the direction: 1, north; 2, south; 3, east; or 4, west. This movement doesn't provoke opportunity attacks, and if the direction rolled is blocked, the target doesn't move.",
          "atHigherLevel": "The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
        },
        {
          "name": "Create Bonfire",
          "classes": ["druid", "sorcerer", "warlock", "wizard"],
          "school": "conjuration",
          "level": 0,
          "range": "60 feet",
          "duration": "Concentration, up to 1 minute",
          "casting": "1 action",
          "verbal": true,
          "somatic": true,
          "material": 0,
          "materials": null,
          "concentration": true,
          "ritual": false,
          "description": "You create a bonfire on the ground that you can see within range. Until the spell ends, the magic bonfire fills a 5-foot cube. Any creature in the bonfire's space when you cast the spell must succeed on a Dexterity saving throw or take 1d8 fire damage. A creature must also make the saving throw when it moves into the bonfire's space for the first time on a turn or ends its turn there.\nThe bonfire ignites flammable objects in its area that aren't being worn or carried.",
          "atHigherLevel": "The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8)."
        },
        {
          "name": "Cause Fear",
          "classes": ["warlock", "wizard"],
          "school": "necromancy",
          "level": 1,
          "range": "60 feet",
          "duration": "Concentration, up to 1 minute",
          "casting": "1 action",
          "verbal": true,
          "somatic": false,
          "material": 0,
          "materials": null,
          "concentration": true,
          "ritual": false,
          "description": "You awaken the sense of mortality in one creature you can see within range. A construct or an undead is immune to this effect. The target must succeed on a Wisdom saving throw or become frightened of you until the spell ends. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
          "atHigherLevel": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them."
        },
        {
          "name": "Mind Spike",
          "classes": ["sorcerer", "warlock", "wizard"],
          "school": "divination",
          "level": 2,
          "range": "60 feet",
          "duration": "Up to 1 hour",
          "casting": "1 action",
          "verbal": false,
          "somatic": true,
          "material": 0,
          "materials": null,
          "concentration": true,
          "ritual": false,
          "description": "You reach into the mind of one creature you can see within range. The target must make a Wisdom saving throw, taking 3d8 psychic damage on a failed save, or half as much damage on a successful one. On a failed save, you also always know the target's location until the spell ends, but only while the two of you are on the same plane of existence. While you have this knowledge, the target can't become hidden from you, and if it's invisible, it gains no benefit from that condition against you.",
          "atHigherLevel": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd."
        },
        {
          "name": "Shadow Blade",
          "classes": ["sorcerer", "warlock", "wizard"],
          "school": "illusion",
          "level": 2,
          "range": "Self",
          "duration": "Up to 1 minute",
          "casting": "1 bonus action",
          "verbal": true,
          "somatic": true,
          "material": 0,
          "materials": null,
          "concentration": true,
          "ritual": false,
          "description": "You weave together threads of shadow to create a sword of solidified gloom in your hand. This magic sword lasts until the spell ends. It counts as a simple melee weapon with which you are proficient. It deals 2d8 psychic damage on a hit and has the finesse, light, and thrown properties (range 20/60). In addition, when you use the sword to attack a target that is in dim light or darkness, you make the attack roll with advantage.\n\nIf you drop the weapon or throw it, it dissipates at the end of the turn. Thereafter, while the spell persists, you can use a bonus action to cause the sword to reappear in your hand.",
          "atHigherLevel": "When you cast this spell using a 3rd- or 4th-level spell slot, the damage increases to 3d8. When you cast it using a 5th- or 6th-level spell slot, the damage increases to 4d8. When you cast it using a spell slot of 7th level or higher, the damage increases to 5d8."
        },
        {
          "name": "Earthbind",
          "classes": ["druid", "sorcerer", "warlock", "wizard"],
          "school": "transmutation",
          "level": 2,
          "range": "300 feet",
          "duration": "Up to 1 minute",
          "casting": "1 action",
          "verbal": true,
          "somatic": false,
          "material": 0,
          "materials": null,
          "concentration": true,
          "ritual": false,
          "description": "Choose one creature you can see within range. Yellow strips of magical energy loop around the creature. The target must succeed on a Strength saving throw, or its flying speed (if any) is reduced to 0 feet for the spell's duration. An airborne creature affected by this spell safely descends at 60 feet per round until it reaches the ground or the spell ends."
        },
        {
          "name": "Thunder Step",
          "classes": ["sorcerer", "warlock", "wizard"],
          "school": "conjuration",
          "level": 3,
          "range": "90 feet",
          "duration": "Instantaneous",
          "casting": "1 action",
          "verbal": true,
          "somatic": false,
          "material": 0,
          "materials": null,
          "concentration": false,
          "ritual": false,
          "description": "You teleport yourself to an unoccupied space you can see within range. Immediately after you disappear, a thunderous boom sounds, and each creature within 10 feet of the space you left must make a Constitution saving throw, taking 3d10 thunder damage on a failed save, or half as much damage on a successful one. The thunder can be heard from up to 300 feet away.\n\nYou can bring along objects as long as their weight doesn't exceed what you can carry. You can also teleport one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell, and there must be an unoccupied space within 5 feet of your destination space for the creature to appear in; otherwise, the creature is left behind.",
          "atHigherLevel": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d10 for each slot level above 3rd."
        },
        {
          "name": "Summon Lesser Demons",
          "classes": ["warlock", "wizard"],
          "school": "conjuration",
          "level": 3,
          "range": "60 feet",
          "duration": "Up to 1 hour",
          "casting": "1 action",
          "verbal": true,
          "somatic": true,
          "material": 1,
          "materials": "a vial of blood from a humanoid killed within the past 24 hours",
          "concentration": true,
          "ritual": false,
          "description": "<p>You utter foul words, summoning demons from the chaos of the Abyss. The table below shows the demons summoned based on the roll of a d6.</p><p><table style='border-collapse: collapse;'><thead><tr><th style='border: 1px solid white;'>d6</th><th style='border: 1px solid white;'>Demons Summoned</th></tr></thead><tbody><tr><td style='border: 1px solid white;'>1-2</td><td style='border: 1px solid white;'>Two demons of challenge rating 1 or lower</td></tr><tr><td style='border: 1px solid white;'>3-4</td><td style='border: 1px solid white;'>Four demons of challenge rating 1/2 or lower</td></tr><tr><td style='border: 1px solid white;'>5-6</td><td style='border: 1px solid white;'>Eight demons of challenge rating 1/4 or lower</td></tr></tbody></table></p><p>The DM chooses the demons, such as manes or dretches, and you choose the unoccupied spaces you can see within range where they appear. A summoned demon disappears when it drops to 0 hit points or when the spell ends.</p><p>The demons are hostile to all creatures, including you. Roll initiative for the summoned demons as a group, which has its own turns. The demons pursue and attack the nearest non-demons to the best of their ability.</p><p>As part of casting the spell, you can form a circle on the ground with the blood used as a material component. The circle is large enough to encompass your space. While the spell lasts, the summoned demons can't cross the circle or harm it, and they can't target anyone within it. Using the material component in this manner consumes it when the spell ends.</p>",
          "atHigherLevel": "When you cast this spell using a spell slot of 6th or 7th level, you summon twice as many demons. If you cast it using a spell slot of 8th or 9th level, you summon three times as many demons."
        }
      ],
      "rules": []
    }
  ]
}
